app/Controllers/Admin/WargaController.php

SELECT *
FROM `desa`
WHERE `kecamatan_id` = '1'
---
    function get_desa()
    {
        $kecamatan_id = $this->request->getPost('kecamatan');
        if ($kecamatan_id == '-1') {
            return '';
        } else {
            $desas = model(Desa::class)->where('kecamatan_id', $kecamatan_id)->findAll();