app/Controllers/BaseController.php

    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);

        // Preload any models, libraries, etc, here.

        $this->session = \Config\Services::session();
        if($this->session->has('username')){
            $this->user = model(User::class)->where('username',$this->session->username)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'dinsos'
 LIMIT 1